import sqlite3

def fill_hse_nn_database(db_path="hse_nn.db"):
    with sqlite3.connect(db_path) as conn:
        cur = conn.cursor()
        cur.execute("PRAGMA foreign_keys = ON;")

        cur.execute("INSERT INTO campuses (name) VALUES (?)", ("НИУ ВШЭ — Нижний Новгород",))
        campus_id = cur.lastrowid

        faculties_data = [
            "Факультет экономики",
            "Факультет менеджмента",
            "Факультет права",
            "Факультет гуманитарных наук",
            "Факультет информатики, математики и компьютерных наук",
            "Школа дизайна",
        ]

        faculty_ids = {}
        for name in faculties_data:
            cur.execute("INSERT INTO faculties (name, campus_id) VALUES (?, ?)", (name, campus_id))
            faculty_ids[name] = cur.lastrowid

        tags = []
        
        tag_ids = {}
        for tag_name in tags:
            cur.execute("INSERT INTO tage (name) VALUES (?)", (tag_name,))
            tag_ids[tag_name] = cur.lastrowid

        organizations = [
            "Студенческий совет НИУ ВШЭ — Нижний Новгород",
            "Партнеры",
            "Официальное"
        ]
        
        org_ids = {}
        for org_name in organizations:
            cur.execute("INSERT INTO organizations (name) VALUES (?)", (org_name,))
            org_ids[org_name] = cur.lastrowid

        programs_data = [
            ("Дизайн", faculty_ids["Школа дизайна"], "BAK"),
            ("Иностранные языки и межкультурная бизнес-коммуникация", faculty_ids["Факультет гуманитарных наук"], "BAK"),
            ("Компьютерные науки и технологии (38.03.05)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Компьютерные науки и технологии (09.03.04)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Компьютерные науки и технологии (01.03.02)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Международная программа по бизнесу и экономике (38.03.02)", faculty_ids["Факультет менеджмента"], "BAK"),
            ("Международная программа по бизнесу и экономике (38.03.01)", faculty_ids["Факультет экономики"], "BAK"),
            ("Программная инженерия (очно-заочное обучение)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Технологии искусственного и дополненного интеллекта", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Филология", faculty_ids["Факультет гуманитарных наук"], "BAK"),
            ("Фундаментальная и прикладная лингвистика", faculty_ids["Факультет гуманитарных наук"], "BAK"),
            ("Фундаментальная и прикладная математика (01.03.01)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Фундаментальная и прикладная математика (01.03.04)", faculty_ids["Факультет информатики, математики и компьютерных наук"], "BAK"),
            ("Цифровой маркетинг", faculty_ids["Факультет менеджмента"], "BAK"),
            ("Экономика и бизнес (очно-заочное обучение)", faculty_ids["Факультет экономики"], "BAK"),
            ("Юриспруденция", faculty_ids["Факультет права"], "BAK"),
        ]

        magistracy_data = [
            ("Бизнес-аналитика в экономике и менеджменте (38.04.01)", faculty_ids["Факультет экономики"], "MAG"),
            ("Бизнес-аналитика в экономике и менеджменте (38.04.02)", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Бизнес-информатика", faculty_ids["Факультет информатики, математики и компьютерных наук"], "MAG"),
            ("Интеллектуальный анализ данных", faculty_ids["Факультет информатики, математики и компьютерных наук"], "MAG"),
            ("Искусственный интеллект и компьютерное зрение", faculty_ids["Факультет информатики, математики и компьютерных наук"], "MAG"),
            ("Маркетинг", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Математика", faculty_ids["Факультет информатики, математики и компьютерных наук"], "MAG"),
            ("Прикладная лингвистика и текстовая аналитика / Applied Linguistics and Text Analytics", faculty_ids["Факультет гуманитарных наук"], "MAG"),
            ("Психологическое консультирование", faculty_ids["Факультет гуманитарных наук"], "MAG"),
            ("Современные филологические практики: поэтика, интерпретация, комментарий", faculty_ids["Факультет гуманитарных наук"], "MAG"),
            ("Управление образованием", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Управление организациями и проектами", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Управление правовыми рисками в бизнесе", faculty_ids["Факультет права"], "MAG"),
            ("Управление развитием компании", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Управление финансами компании (38.04.08)", faculty_ids["Факультет экономики"], "MAG"),
            ("Управление финансами компании (38.04.02)", faculty_ids["Факультет менеджмента"], "MAG"),
            ("Финансовые технологии", faculty_ids["Факультет информатики, математики и компьютерных наук"], "MAG"),
            ("Финансы", faculty_ids["Факультет экономики"], "MAG"),
            ("Цифровой маркетинг", faculty_ids["Факультет менеджмента"], "MAG"),
        ]

        program_ids = {}
        for name, fid, degree in programs_data + magistracy_data:
            cur.execute(
                "INSERT INTO programs (name, faculty_id, degree) VALUES (?, ?, ?)",
                (name, fid, degree),
            )
            program_ids[name] = cur.lastrowid
